УРВ_файловая/src/InformationRegisters/РазрешенияДоступаКОбращениям/РазрешенияДоступаКОбращениям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РазрешенияДоступаКОбращениям</name>
  <dimensions>
    <name>Обращение</name>
    <type>
      <types>DocumentRef.Обращение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбслуживающаяОрганизация</name>
    <type>
      <types>CatalogRef.ОбслуживающиеОрганизации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УРВ_файловая/src/InformationRegisters/РазрешенияДоступаКОбращениям/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет запись по переданным параметрам
//
Процедура ДобавитьЗапись(Обращение, ОбслуживающаяОрганизация) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Менеджер = РегистрыСведений.РазрешенияДоступаКОбращениям.СоздатьМенеджерЗаписи();
	Менеджер.Обращение = Обращение;
	Менеджер.ОбслуживающаяОрганизация = ОбслуживающаяОрганизация;
	Менеджер.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
